# Задание 5
revenue = int(input('Введите размер выручки: '))
costs = int(input('Введите размер издержек: '))
profit = revenue-costs
print(f'Размер прибыли составил: {profit} у.е.')